{
  "basic_info": {
    "name": "Carlos Hernández Martínez",
    "image_path": "me.jpg",
    "personal_image_alt": "Carlos Hernández Martínez",
    "availability": "QA Automation Engineering en Mercadona IT",
    "emails": ["chermar.pro@gmail.com", "carlos.cbm32@gmail.com"],
    "linkedin": "https://linkedin.com/in/carl0shdez",
    "github": "https://github.com/Tempus23",
    "location": "Valencia, España (disponible remoto)",
    "tagline": "Ingeniero Informático en formación con experiencia en QA Automation y proyectos de Machine Learning aplicados. Interés en aplicar la IA y la ingeniería de software para resolver problemas reales."
  },
  "about_me": {
    "description_paragraphs": [
      "Soy estudiante de último curso de Ingeniería Informática en la Universidad Politécnica de Valencia, especializado en Inteligencia Artificial y Machine Learning. Complemento mi formación académica con experiencia práctica en QA Automation e investigación aplicada en visión por computador.",
      "Actualmente trabajo en Mercadona IT como QA Automation Engineering, donde diseño y ejecuto pruebas automatizadas E2E con Playwright y Postman. Previamente, realicé prácticas en Urobora SL como AI Software Engineering Intern, desarrollando microservicios y agentes basados en LLM para automatización de procesos.",
      "También he colaborado en proyectos de investigación en la Technical University of Munich junto a KUKA, aplicando modelos neuronales implícitos en robótica, y en mi Trabajo de Fin de Grado en la UPV sobre clasificación automática de artrosis de rodilla con deep learning. Me considero una persona proactiva, con capacidad de adaptación y motivación por aprender."
    ],
    "attributes": [
      "Proactivo",
      "Orientado al aprendizaje",
      "Resolución de problemas",
      "Trabajo en equipo",
      "Comunicación efectiva",
      "Gestión del tiempo"
    ]
  },
  "professional_experience": [
    {
      "date": "jul. 2025 - actual",
      "title": "QA Automation Engineering",
      "company": "Mercadona IT",
      "description": "Diseño y desarrollo de planes de pruebas automatizadas dentro del ecosistema DevHub Edge. Creación de escenarios E2E con Playwright y Postman. Colaboración con Tech Leads, Product Owners y desarrolladores para detectar riesgos y mejorar la fiabilidad del software."
    },
    {
      "date": "oct. 2024 - jun. 2025",
      "title": "AI Software Engineering Intern",
      "company": "Urobora SL",
      "description": "Prácticas en desarrollo de agentes de IA basados en LLM y microservicios en Python. Implementación de backend con FastAPI y despliegues en Google Cloud Platform. Colaboración en el diseño de pipelines CI/CD y en la integración de servicios de IA para automatización empresarial."
    },
    {
      "date": "2025",
      "title": "Trabajo de Fin de Grado - Clasificación Automática de Osteoartritis",
      "company": "Universidad Politécnica de Valencia",
      "description": "Desarrollo de modelos de deep learning en PyTorch y TensorFlow para la clasificación automática de artrosis de rodilla. Uso de técnicas de fine-tuning en datasets médicos limitados y validación cruzada con otros dominios."
    },
    {
      "date": "2024",
      "title": "Estancia Erasmus - Investigación en Representaciones Implícitas",
      "company": "Technical University of Munich (colaboración con KUKA)",
      "description": "Colaboración en investigación sobre modelos neuronales implícitos aplicados a la detección de colisiones en robótica. Desarrollo de prototipos en PyTorch y exploración de técnicas de optimización de modelos."
    }
  ],
  "academic_formation": [
    {
      "date": "2021-2025",
      "title": "Grado en Ingeniería Informática",
      "company": "Universidad Politécnica de Valencia (UPV)",
      "description": "Nota media: 7,7. Especialización en Inteligencia Artificial y Machine Learning. Formación en programación, algoritmos, bases de datos y arquitecturas de software."
    },
    {
      "date": "6 meses, 2024",
      "title": "Erasmus en Computer Science",
      "company": "Technical University of Munich (TUM)",
      "description": "Programa de intercambio internacional enfocado en IA y robótica. Participación en proyectos de investigación aplicada en modelos neuronales implícitos."
    },
    {
      "date": "2023",
      "title": "Akademia Bankinter Innovation Foundation",
      "company": "Bankinter Innovation Foundation",
      "description": "Programa de formación en innovación y emprendimiento tecnológico. Desarrollo de habilidades en liderazgo y gestión de proyectos innovadores."
    },
    {
      "date": "2019-2020",
      "title": "Diploma en Innovación Social",
      "company": "CEU San Pablo Valencia",
      "description": "Formación en innovación social y responsabilidad corporativa en colaboración con Edwards Lifesciences."
    }
  ],
  "skills": {
    "technical": [
      "Python",
      "JavaScript / TypeScript",
      "Playwright",
      "Postman",
      "PyTorch",
      "TensorFlow",
      "FastAPI",
      "Git",
      "Docker",
      "Podman",
      "Kubernetes",
      "GitHub Actions",
      "Jenkins / CloudBees",
      "Spinnaker",
      "MySQL",
      "MongoDB",
      "Google Cloud Platform",
      "Microsoft Azure",
      "Cloudflare Workers",
      "CI/CD Pipelines",
      "APIs REST",
      "Prompt Engineering"
    ],
    "competencies": [
      "Trabajo en equipo multidisciplinar",
      "Comunicación efectiva",
      "Pensamiento crítico",
      "Resolución de problemas",
      "Gestión del tiempo y priorización",
      "Aprendizaje continuo",
      "Adaptabilidad en entornos ágiles"
    ]
  },
  "projects": [
    {
      "title": "Clasificación Automática de Osteoartritis de Rodilla",
      "description": "Proyecto de TFG en la UPV aplicando modelos de deep learning (PyTorch, TensorFlow) sobre radiografías médicas para detección de artrosis. Incluye técnicas de fine-tuning y validación cross-domain.",
      "link": "",
      "github": "https://github.com/Tempus23/Radiography_TFG",
      "image": "projects/rodilla-artrosis.png",
      "tags": ["PyTorch", "TensorFlow"]
    },
    {
      "title": "Neural Implicit Swept Volume Models",
      "description": "Colaboración en la TUM con KUKA para el desarrollo de modelos neuronales implícitos aplicados a la detección de colisiones en robótica. Prototipado en PyTorch.",
      "link": "",
      "github": "https://github.com/Amrsaeed/FastCollisionDetection",
      "image": "projects/sweept-volume.png",
      "tags": ["PyTorch"]
    }
  ],
  "footer_info": {
    "copyright_name": "Carlos Hernández Martínez",
    "contact_email": "chermar.pro@gmail.com",
    "about_me_link": "/mi-portfolio/#sobre-mi"
  }
}
